InformationRegisters/кб_НезавершенныеПроизводственныеТранзакции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кб_НезавершенныеПроизводственныеТранзакции</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТранзакцияОткрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПродукцияЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерОперацииНезавершенногоПроизводства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВСД2_Производство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВСД2_Производство</Name>
			<Comment>api 2.*</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.кб_НезавершенныеПроизводственныеТранзакции</xr:Item>
				<xr:Item>AccumulationRegister.кб99_ОстаткиПартийВСД</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Производитель_ХозСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ-основание</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>cargoInspected</Name>
					<Comment>Отметка об обследовании партии продукции ветеринарным врачом.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатыИсследований</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кб99_РезультатИсследования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>operationId</Name>
					<Comment>№ транзакции при НЗП</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершитьОперацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСрокГодности1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСрокГодности2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправкаПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершениеПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Продукция</Name>
					<Comment>Можно фасовку добавить</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приход</Name>
							<Comment>1 - приход,0 - расход</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ВидПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПродукции</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция_Элемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скоропортящийся</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Некачественный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСрокГодности1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСрокГодности2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПартии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество1с</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПартииСписания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ВидПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция_Элемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УровниУпаковки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаПродукции</Name>
							<Comment>Связь с таблицей Продукция</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерУровня</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_УровниУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ФормыУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маркировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерУровня</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_УровниУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_Маркировка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маркировка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПродукции</Name>
							<Comment>Связь с таблицей Продукция</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПартииРезультат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ВетИС_ПроизводствоСервер/Ext/Module.bsl
#Область СписаниеВПроизводство

// GRACE:MODULE_START name="ВетИС_ПроизводствоСервер"
// @grace-module: ВетИС_ПроизводствоСервер
// @grace-purpose: Производственные транзакции ВетИС: формирование сырья, списание партий, оформление производства
// @grace-depends: ВетИС_ЯдроСервер, ВетИС_ДокументооборотСервер, ВетИС_APIСервер, РегистрыПартий
// @grace-version: 2.0
// @grace-contract-ref: docs/Contracts.xml -> module="ВетИС_ПроизводствоСервер"
// GRACE:DEPENDENCY target="ЯдроВСД"
// GRACE:DEPENDENCY target="ДокументооборотВСД"
// GRACE:DEPENDENCY target="ИнтеграцияВетИС_API"
// GRACE:DEPENDENCY target="РегистрыПартий"

//Возвращает Продукция_Элементы и Количество сырья , требуемое для выпуска КоличествоПродукции ВыбраннойПродукции
// GRACE:CONTRACT function="ПолучитьТзСырьеПоВСД_Продукция_Элемент"
Функция ПолучитьТзСырьеПоВСД_Продукция_Элемент(ВыбраннаяПродукция, КоличествоПродукции = 0) Экспорт
	
	ТЗСырье = Новый ("ТаблицаЗначений");
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	кб99_ПроизводственнаяСпецификация.Сырье КАК Продукция_Элемент,
				   |	Значение(Справочник.Контрагенты.ПустаяСсылка) Как Контрагент,
				   |	кб99_ПроизводственнаяСпецификация.Коэффициент
                   |ИЗ
                   |	РегистрСведений.кб99_ПроизводственнаяСпецификация КАК кб99_ПроизводственнаяСпецификация
                   |ГДЕ
                   |	кб99_ПроизводственнаяСпецификация.Продукция = &ВыбПродукция";
    Запрос.УстановитьПараметр("ВыбПродукция", ВыбраннаяПродукция);

    ТЗСырье = Запрос.Выполнить().Выгрузить();
	ТЗСырье.Колонки.Добавить("Количество",новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3)));  //Требуемое кол-во сырья на 100 кг ВыбраннаяПродукция
	Если КоличествоПродукции <> 0 Тогда
		Для Каждого СтрСырье Из ТЗСырье Цикл
			СтрСырье.Количество = КоличествоПродукции * СтрСырье.Коэффициент / 100; // на 100 кг продукции
		КонецЦикла
	КонецЕсли;
	
	Возврат ТЗСырье;
	
КонецФункции

//СформироватьТЧСырьяДляСписанияВПроизводствоПоСписку
// GRACE:CONTRACT function="ЗаполнитьСырьеИзВСД_Продукция_Элемент"
Функция ЗаполнитьСырьеИзВСД_Продукция_Элемент(тзПродукции) Экспорт
	
	ТЗВсегоСырье = Новый ("ТаблицаЗначений");
	ТЗВсегоСырье.Колонки.Добавить("Продукция_Элемент", Новый ОписаниеТипов("СправочникСсылка.ВСД_Продукция_Элемент"));
	ТЗВсегоСырье.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3)));
	ТЗВсегоСырье.Колонки.Добавить("Количество1с", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3)));
	ТЗВсегоСырье.Колонки.Добавить("СерияНоменклатуры", Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(20)));
	ТЗВсегоСырье.Колонки.Добавить("Контрагент");
	
	Для Каждого СтрокаПродукции Из тзПродукции Цикл
		тзСырье = ПолучитьТзСырьеПоВСД_Продукция_Элемент( СтрокаПродукции.Продукция_Элемент, СтрокаПродукции.Количество );
		Для Каждого СтрокаСырье Из ТЗСырье Цикл
			ЗаполнитьЗначенияСвойств(ТЗВсегоСырье.Добавить(), СтрокаСырье) 
		КонецЦикла
	КонецЦикла;
	
	ТЗВсегоСырье.Свернуть("Продукция_Элемент", "Количество, Количество1с");
	
	Возврат ТЗВсегоСырье; 
	
КонецФункции

// GRACE:CONTRACT function="тзЗаполнитьПартииСписанияПоТзПродукция"
Функция тзЗаполнитьПартииСписанияПоТзПродукция(Параметры, тзЭлементыкСписанию, СтрОснование, тзАктуальныхПартий, ПартииКСписанию) Экспорт
	
	КоличествоСписания = СтрОснование.Количество;
	
	Если НЕ ЗначениеЗаполнено(тзАктуальныхПартий) Тогда
		Если Параметры["ПарамЗаполнятьТранзакциюПриОтсутствииПартий"] Тогда
			НоваяСтрока = ПартииКСписанию.Добавить();
			НоваяСтрока.Номенклатура = СтрОснование.НоменклатураСырье;
			НоваяСтрока.Количество = КоличествоСписания;
		КонецЕсли;
		ВетИС_ЯдроСервер.СообщитьИнфо("Не переданы параметры для получения Актуальных партий - ДанныеЗаполнения или тзЭлементыОснования");
		Возврат ПартииКСписанию;
	КонецЕсли;
	
	СтрокиПартий = ВетИС_ЯдроСервер.ПодобратьПартии( тзАктуальныхПартий, КоличествоСписания );
	Если СтрокиПартий.Количество() = 0  Тогда
		Если Параметры["ПарамЗаполнятьТранзакциюПриОтсутствииПартий"] Тогда
			НоваяСтрока = ПартииКСписанию.Добавить();
			НоваяСтрока.Номенклатура = СтрОснование.НоменклатураСырье;
			НоваяСтрока.Количество = КоличествоСписания;
		КонецЕсли;
		ВетИС_ЯдроСервер.СообщитьИнфо("Нет партий пропускаем..");				
	КонецЕсли;
	
	Для Каждого СтрПартии Из СтрокиПартий Цикл
		НоваяСтрока = ПартииКСписанию.Добавить();
		НоваяСтрока.Номенклатура = СтрОснование.НоменклатураСырье;
		НоваяСтрока.Партия = СтрПартии.Партия;
		НоваяСтрока.Количество = СтрПартии.Количество;
		НоваяСтрока.ЕдиницаИзмерения = СтрПартии.Партия.ЕдиницаИзмерения;
		НоваяСтрока.Продукция_Элемент = НоваяСтрока.Партия.Продукция_Элемент;			
		НоваяСтрока.Продукция = НоваяСтрока.Партия.Продукция;			
		НоваяСтрока.ВидПродукции = НоваяСтрока.Партия.ВидПродукции;			
	КонецЦикла;
	
	Если (СтрокиПартий.Итог("Количество") < КоличествоСписания) и Параметры["ПарамЗаполнятьТранзакциюПриОтсутствииПартий"]  Тогда
		//Добавим с пустыми партиями
		НоваяСтрока = ПартииКСписанию.Добавить();
		НоваяСтрока.Номенклатура = СтрОснование.НоменклатураСырье;
		НоваяСтрока.Количество	=  КоличествоСписания - СтрокиПартий.Итог("Количество") ;
	КонецЕсли; 
	
	Возврат ПартииКСписанию;
	
КонецФункции

//Возвращает Продукция_Элементы и Количество сырья , требуемое для выпуска КоличествоПродукции ВыбраннойПродукции
Функция ПолучитьСырьеИзСпецификацииНоменклатуры( ВыбНоменклатура, КоличествоПродукции = 0) 
	
	тзСырье = Новый("ТаблицаЗначений");
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	СпецификацииНоменклатуры.Ссылка.Владелец КАК НоменклатураПродукция,
                   |	СпецификацииНоменклатуры.Ссылка.Количество КАК КоличествоПродукции,
                   |	СпецификацииНоменклатуры.Номенклатура КАК НоменклатураСырье,
                   |	СпецификацииНоменклатуры.Количество КАК КоличествоСырья,
                   |	ВСД_Соответсвия.ПродукцияЭлемент КАК Продукция_Элемент
                   |ИЗ
                   |	Справочник.СпецификацииНоменклатуры.ИсходныеКомплектующие КАК СпецификацииНоменклатуры
                   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВСД_Соответсвия КАК ВСД_Соответсвия
                   |		ПО СпецификацииНоменклатуры.Номенклатура = ВСД_Соответсвия.Владелец
                   |ГДЕ
                   |	СпецификацииНоменклатуры.Ссылка.Владелец = &ВыбНоменклатура";
	
    Запрос.УстановитьПараметр("ВыбНоменклатура", ВыбНоменклатура);

    ТЗСырье = Запрос.Выполнить().Выгрузить();
	ТЗСырье.Колонки.Добавить("Количество",новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3)));  //Требуемое кол-во сырья на 1 кг ВыбНоменклатура
	
	Если КоличествоПродукции > 0 Тогда
		Для Каждого СтрСырье Из ТЗСырье Цикл
			СтрСырье.Количество = КоличествоПродукции * СтрСырье.КоличествоСырья / СтрСырье.КоличествоПродукции;
		КонецЦикла
	КонецЕсли;
	
	Возврат ТЗСырье;
	
КонецФункции

// GRACE:CONTRACT function="ЗаполнитьТчСписаниеИзСпецификацииНоменклатуры"
Функция ЗаполнитьТчСписаниеИзСпецификацииНоменклатуры( Знач Параметры, тзНоменклатуры ) Экспорт
	
	// вызов переопределения
	ПереопределенныйМодуль = ВетИС_УтилитыКлиентСервер.ФункцияПереопределена("ЗаполнитьТчСписаниеИзСпецификацииНоменклатуры");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		Возврат ПереопределенныйМодуль.ЗаполнитьТчСписаниеИзСпецификацииНоменклатуры( Параметры, тзНоменклатуры );
	КонецЕсли;
	
	// LLM_NOTE: Обработка исключений критически важна для производственных транзакций - при ошибке возвращается пустая таблица, чтобы не прерывать процесс оформления
	Попытка 
		ПартииКСписанию = новый ("ТаблицаЗначений"); //Можно структуру скопировать из вызывающего документа, если в параметр его добавить
		ПартииКСписанию.Колонки.Добавить("Номенклатура",новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ПартииКСписанию.Колонки.Добавить("Продукция_Элемент",новый ОписаниеТипов("СправочникСсылка.ВСД_Продукция_Элемент"));
		ПартииКСписанию.Колонки.Добавить("Продукция",новый ОписаниеТипов("СправочникСсылка.ВСД_Продукция"));
		ПартииКСписанию.Колонки.Добавить("ВидПродукции",новый ОписаниеТипов("СправочникСсылка.ВСД_ВидПродукции"));
		ПартииКСписанию.Колонки.Добавить("Партия",новый ОписаниеТипов("СправочникСсылка.ВСД_Партия"));
		ПартииКСписанию.Колонки.Добавить("Количество",новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3)));
		ПартииКСписанию.Колонки.Добавить("Упаковки",новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3)));
		ПартииКСписанию.Колонки.Добавить("ЕдиницаИзмерения",новый ОписаниеТипов("СправочникСсылка.ВСД_ЕдиницыИзмерения"));
		
		Для Каждого СтрокаПродукции Из тзНоменклатуры Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаПродукции.Номенклатура) Тогда 
				ВетИС_ЯдроСервер.СообщитьИнфо("Номенклатура не заполнена в строке"+СтрокаПродукции.НомерСтроки);
				Продолжить;
			КонецЕсли;			
			
			//1. Получаем список ВСД_Продукция_Элемент для Сырья Номенклатуры из Спецификации
			ТЗСырье = Новый("ТаблицаЗначений");
		    Запрос = Новый Запрос;
		    Запрос.Текст = "ВЫБРАТЬ
		                   |	СпецификацииНоменклатуры.Ссылка.Владелец КАК НоменклатураПродукция,
		                   |	СпецификацииНоменклатуры.Ссылка.Количество КАК КоличествоПродукции,
		                   |	СпецификацииНоменклатуры.Номенклатура КАК НоменклатураСырье,
		                   |	СпецификацииНоменклатуры.Количество КАК КоличествоСырья,
		                   |	ВСД_Соответсвия.ПродукцияЭлемент КАК Продукция_Элемент
		                   |ИЗ
		                   |	Справочник.СпецификацииНоменклатуры.ИсходныеКомплектующие КАК СпецификацииНоменклатуры
		                   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВСД_Соответсвия КАК ВСД_Соответсвия
		                   |		ПО СпецификацииНоменклатуры.Номенклатура = ВСД_Соответсвия.Владелец
		                   |ГДЕ
		                   |	СпецификацииНоменклатуры.Ссылка.Владелец В ИЕРАРХИИ ( &ВыбНоменклатура) ";
			
		    Запрос.УстановитьПараметр("ВыбНоменклатура", СтрокаПродукции.Номенклатура );
			тзСырье = Запрос.Выполнить().Выгрузить();
			
			//2. Формируем Актуальные партии для всего сырья = списка тзСырье
			тзПартий = ВетИС_ЯдроСервер.ПолучитьАктуальныеПартии( Параметры, тзСырье.ВыгрузитьКолонку("Продукция_Элемент"), Параметры["Отправитель_Площадка"], Параметры["Отправитель_ХозСубъект"]);
		
			тзСырье = ПолучитьСырьеИзСпецификацииНоменклатуры( СтрокаПродукции.Номенклатура, СтрокаПродукции.Количество );
			Если НЕ ЗначениеЗаполнено(тзСырье ) Тогда 
				Продолжить;
			КонецЕсли;
			
			тзСырье.Свернуть("НоменклатураСырье, Количество");
			
			Для Каждого Ингредиент Из тзСырье Цикл
				тзАктуальныхПартий = ВетИС_ЯдроСервер.ПодобратьПартииПоПродукцияЭлемент(Параметры, тзПартий, Неопределено, Ингредиент.Количество, , Ингредиент.НоменклатураСырье);
				тзЗаполнитьПартииСписанияПоТзПродукция( Параметры, тзСырье, Ингредиент, тзАктуальныхПартий, ПартииКСписанию);
			КонецЦикла;
		КонецЦикла;
	// LLM_NOTE: Обработка исключений критически важна для производственных транзакций - при ошибке возвращается пустая таблица, чтобы не прерывать процесс оформления
	Исключение
		ВетИС_ЯдроСервер.СообщитьИнфо("Ошибка "+ОписаниеОшибки());
		ПартииКСписанию = Новый ТаблицаЗначений;
	КонецПопытки;
	
	ПартииКСписанию.Свернуть("Номенклатура, Продукция_Элемент, Продукция, ВидПродукции, Партия, ЕдиницаИзмерения", "Количество, Упаковки");    
	
	Возврат ПартииКСписанию;
	
КонецФункции

// GRACE:CONTRACT function="ПолучитьНомерПартии"
Функция ПолучитьНомерПартии( Знач ПараметрыОрганизации, СтрокаТчДок ) Экспорт
	
	// вызов переопределения
	ПереопределенныйМодуль = ВетИС_УтилитыКлиентСервер.ФункцияПереопределена("ПолучитьНомерПартии");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		Возврат ПереопределенныйМодуль.ПолучитьНомерПартии( ПараметрыОрганизации, СтрокаТчДок );
	КонецЕсли;

	// LLM_NOTE: Обработка исключений при формировании номера партии - возвращается пустая строка, чтобы не прерывать процесс производства
	Попытка
		Возврат Формат( ТекущаяДата(), "ДЛФ=Д");
	Исключение
		Возврат "";
	КонецПопытки;
	
КонецФункции

#КонецОбласти

// GRACE:CONTRACT function="ПолучитьНомерНезавершенногоПроизводства"
Функция ПолучитьНомерНезавершенногоПроизводства(ПараметрыОрганизации, СтрокаТЧ) Экспорт
	
	// вызов переопределения
	ПереопределенныйМодуль = ВетИС_УтилитыКлиентСервер.ФункцияПереопределена("ПолучитьНомерНезавершенногоПроизводства");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		Возврат ПереопределенныйМодуль.ПолучитьНомерНезавершенногоПроизводства( ПараметрыОрганизации, СтрокаТЧ );
	КонецЕсли;
	
	Префикс = ПараметрыОрганизации.ПрефиксНомераНезавершенногоПроизводства;
	Артикул = ВетИС_ЗаполнениеДокументовСервер.ПолучитьАртикулНоменклатуры(ПараметрыОрганизации, СтрокаТЧ, "", "");
	КодПлощадки = Число(ПараметрыОрганизации.Отправитель_Площадка.Код);
	Если ЗначениеЗаполнено(СтрокаТЧ.СерияНоменклатуры) Тогда 		
		ДатаПроизводства = Формат(СтрокаТЧ.СерияНоменклатуры.ДатаПроизводства, "ДФ=yyyy-MM-dd");
	Иначе
		ДатаПроизводства = "";
	КонецЕсли;
	
	Возврат Префикс + "_" + Артикул + "_" + Строка(КодПлощадки) + "_" + ДатаПроизводства;
	
КонецФункции

// GRACE:CONTRACT function="ПроизводственнаяТранзакцияОткрыта"
Функция ПроизводственнаяТранзакцияОткрыта(ВыбДок) Экспорт

	Отбор = Новый Структура();
	Отбор.Вставить("НомерОперацииНезавершенногоПроизводства", ВыбДок.operationId);
	Отбор.Вставить("Площадка", ВыбДок.Производитель_Площадка);
	
	Запись = РегистрыСведений.кб_НезавершенныеПроизводственныеТранзакции.ПолучитьПоследнее(ТекущаяДатаСеанса(), Отбор);
	
	Возврат Запись.ТранзакцияОткрыта;
	
КонецФункции

// GRACE:CONTRACT function="ОформитьДокументЗавершенияПроизводства"
Функция ОформитьДокументЗавершенияПроизводства(ДанныеЗаполнения) Экспорт
	
	ПараметрыОрганизации = ДанныеЗаполнения.ПараметрыОрганизации;
	
	НовыйДокумент = Документы.ВСД2_Производство.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(НовыйДокумент, ПараметрыОрганизации);
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	НовыйДокумент.ЗавершитьОперацию = Истина;
	НовыйДокумент.cargoInspected = Истина;
	НовыйДокумент.operationId = ДанныеЗаполнения.НомерОперации;
	НовыйДокумент.РезультатыИсследований = ПараметрыОрганизации["ВСД_РезультатыИсследований"];
	НовыйДокумент.Производитель_Площадка = ДанныеЗаполнения.Площадка;
	НовыйДокумент.Производитель_ХозСубъект = ДанныеЗаполнения.Площадка.ХозСубъект;
	Для Каждого Стр Из ДанныеЗаполнения.СписокПродукции Цикл
		нСтр = НовыйДокумент.Продукция.Добавить();
		нСтр.Продукция_Элемент = Стр.ПродукцияЭлемент;
		нСтр.ДатаИзготовления1 = Стр.ДатаПроизводства;
	КонецЦикла;
	
	// LLM_NOTE: Запись документа завершения производства в транзакции - критично для фиксации операции в ВетИС и предотвращения дублирования
	НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);

	Если ПараметрыОрганизации.ВыводитьПодробнуюИнформацию Тогда
		ВетИС_ЯдроСервер.СообщитьИнфо("Записан документ оформления завершения производства ["+НовыйДокумент.Ссылка+"]", НовыйДокумент.Ссылка);	
	КонецЕсли;

	Возврат НовыйДокумент.Ссылка;
	
КонецФункции

// GRACE:CONTRACT function="ОформитьПроизводствоПострочно"
Функция ОформитьПроизводствоПострочно(ПараметрыОрганизации, ДокументОснование) Экспорт

	ТЗ = ВетИС_ЗаполнениеДокументовСервер.ВыгрузитьТЧ(ДокументОснование, ПараметрыОрганизации);
	ТЗ.Свернуть("Номенклатура, Продукция_Элемент, СерияНоменклатуры", "Количество, Количество1с");
	ВыбДата = ДокументОснование.Дата;
	мсДокументов = Новый Массив;
	Для Каждого СтрокаТЧ Из ТЗ Цикл
	
		Если ЗначениеЗаполнено(СтрокаТЧ.СерияНоменклатуры) Тогда 
			
			ДатаИзготовления1 = СтрокаТЧ.СерияНоменклатуры;		
			ДатаСрокГодности1 = ДатаИзготовления1 + 60 * 60 * 24 * СтрокаТЧ.Продукция_Элемент.СрокГодности;
		
			Если СтрокаТЧ.СерияНоменклатуры > ТекущаяДатаСеанса() Тогда 
				ВетИС_ЯдроСервер.СообщитьИнфо("Продукция не заполнена! Дата проиводства в серии не может быть больше текущей.");	
				Возврат "";
			КонецЕсли;
		Иначе
			
			ДатаИзготовления1 = ДокументОснование.Дата;		
			ДатаСрокГодности1 = ДатаИзготовления1 + 60 * 60 * 24 * СтрокаТЧ.Продукция_Элемент.СрокГодности;
			
		КонецЕсли;  
		
		ДокВСД = Документы.ВСД2_Производство.СоздатьДокумент(); 
		ДокВСД.ДокументОснование = ДокументОснование;
		ДокВСД.Дата = ТекущаяДатаСеанса(); 		
		ДокВСД.Организация = ДокументОснование.Организация;
		ДокВСД.Производитель_ХозСубъект = ПараметрыОрганизации.Отправитель_ХозСубъект;
		ДокВСД.Производитель_площадка = ПараметрыОрганизации.Отправитель_Площадка;
		ДокВСД.ЗавершитьОперацию = ПараметрыОрганизации["ЗавершатьПроизводство"];

		Если ПараметрыОрганизации.Свойство("НомерНезавершенногоПроизводства") Тогда
			ДокВСД.operationId = ПараметрыОрганизации.НомерНезавершенногоПроизводства;
		КонецЕсли;
		
		Если Не ДокВСД.ЗавершитьОперацию И Не ЗначениеЗаполнено(ДокВСД.operationId) Тогда
			ДокВСД.operationId = ПолучитьНомерНезавершенногоПроизводства(ПараметрыОрганизации, СтрокаТЧ);
		КонецЕсли;
		
		ДокВСД.РезультатыИсследований = ПараметрыОрганизации.ВСД_РезультатыИсследований;
		ДокВСД.cargoInspected	= Истина;
		ДокВСД.НомерПартии = Формат(ВыбДата, "ДЛФ=Д");				
		
		НоваяСтрока = ДокВСД.Продукция.Добавить();
		НоваяСтрока.Номенклатура = СтрокаТЧ.Номенклатура;
		НоваяСтрока.Продукция_Элемент = СтрокаТЧ.Продукция_Элемент;
		НоваяСтрока.Продукция = НоваяСтрока.Продукция_Элемент.Продукция ;
		НоваяСтрока.ВидПродукции =  НоваяСтрока.Продукция_Элемент.ВидПродукции;
		НоваяСтрока.НаименованиеПродукции =  НоваяСтрока.Продукция_Элемент.Наименование;
		НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Продукция_Элемент.ЕдиницаИзмерения;	
		НоваяСтрока.Количество = СтрокаТЧ.Количество;
		НоваяСтрока.Количество1с = СтрокаТЧ.Количество1с;
		НоваяСтрока.ДатаИзготовления1 = ДатаИзготовления1;		
		НоваяСтрока.ДатаСрокГодности1 = ДатаСрокГодности1;	
		НоваяСтрока.НомерПартии = ПолучитьНомерПартии(ПараметрыОрганизации, НоваяСтрока);
		НоваяСтрока.Скоропортящийся	= НоваяСтрока.Продукция_Элемент.Скоропортящийся;
		
		Попытка
			Если ПараметрыОрганизации["ПарамПроизводствоЗаполнятьПоСправочнику"] Тогда 			
				тзПартии = ЗаполнитьТчСписаниеИзСпецификацииНоменклатуры( ПараметрыОрганизации, ДокВСД.Продукция.Выгрузить() );
			Иначе
				Сырье = ЗаполнитьСырьеИзВСД_Продукция_Элемент( ДокВСД.Продукция.Выгрузить() );
				тзПартии = ВетИС_ЯдроСервер.тзПартииСписанияПоТзПродукция_Элемент( ПараметрыОрганизации, Сырье );
			КонецЕсли;
			ДокВСД.ПартииСписания.Загрузить( тзПартии );
			Если ЗначениеЗаполнено(тзПартии) Тогда
				ДанныеЗаполнения = Новый Структура("ВыбДата", ВыбДата);
				ДокВСД.ПолучитьВторичнуюПродукциюПриПереработке(ДанныеЗаполнения, тзПартии);	
			КонецЕсли;
		Исключение
			ВетИС_ЯдроСервер.СообщитьИнфо("Не удалось загрузить партии списания");
		КонецПопытки;
	
		ДокВСД.Записать();
	    мсДокументов.Добавить(ДокВСД.Ссылка);
		
	КонецЦикла;
	
	Возврат мсДокументов;
	
КонецФункции

// GRACE:CONTRACT function="ЗаполнитьУровниУпаковкиИМаркировку"
Процедура ЗаполнитьУровниУпаковкиИМаркировку(СтрПродукции, Док, ПараметрыОрганизации) Экспорт
	
	Если ПараметрыОрганизации = Неопределено Тогда
		ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры(Док.Организация);
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(СтрПродукции.КлючСтроки) Тогда
		СтрПродукции.КлючСтроки = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	СтруктураДляПоиска = Новый Структура("СтрокаПродукции", СтрПродукции.КлючСтроки); 
	МассивПустыхСтрок = Док.Маркировка.НайтиСтроки(СтруктураДляПоиска); 
	Для Каждого Строка Из МассивПустыхСтрок Цикл 
		Док.Маркировка.Удалить(Строка); 
	КонецЦикла;
	
	МассивПустыхСтрок = Док.УровниУпаковки.НайтиСтроки(СтруктураДляПоиска); 
	Для Каждого Строка Из МассивПустыхСтрок Цикл 
		Док.УровниУпаковки.Удалить(Строка); 
	КонецЦикла;
	
	СтрокаУпак = Док.УровниУпаковки.Добавить(); 
	СтрокаУпак.СтрокаПродукции = СтрПродукции.КлючСтроки;
	СтрокаУпак.НомерУровня = ПараметрыОрганизации["ПарамНомерУровняУпаковкиДляВСД"];
	Если ЗначениеЗаполнено(СтрПродукции.Продукция_Элемент) Тогда
		СтрокаУпак.ФормаУпаковки = СтрПродукции.Продукция_Элемент.ФасовкаФормаУпаковки;
		СтрокаУпак.Количество = Цел(СтрПродукции.Количество / 
			?(СтрПродукции.Продукция_Элемент.ФасовкаОбъем=0, 1, СтрПродукции.Продукция_Элемент.ФасовкаОбъем));	
		Если Не ЗначениеЗаполнено(СтрокаУпак.ФормаУпаковки) Тогда
			СтрокаУпак.ФормаУпаковки = ПараметрыОрганизации["ПарамФормаУпаковкиДляВСД"];
		КонецЕсли;
	Иначе
		СтрокаУпак.ФормаУпаковки = ПараметрыОрганизации["ПарамФормаУпаковкиДляВСД"];
		СтрокаУпак.Количество = Цел(СтрПродукции.Количество);
	КонецЕсли;
	Если СтрокаУпак.Количество = 0 Тогда
		СтрокаУпак.Количество = 1;	
	КонецЕсли;
	//Маркировки
	СтрокаМарк = Док.Маркировка.Добавить();
	СтрокаМарк.Строкапродукции = СтрокаУпак.СтрокаПродукции;
	СтрокаМарк.НомерУровня = СтрокаУпак.НомерУровня;
	СтрокаМарк.Класс = Перечисления.кб99_Маркировка.UNDEFINED;
	СтрокаМарк.Маркировка = Док.Производитель_Площадка.Наименование;
	
КонецПроцедуры

// GRACE:MODULE_END name="ВетИС_ПроизводствоСервер"
